
#+TITLE: Verteilte Systeme \linebreak \small...für C++ Programmierer \hfill Prozesse
#+AUTHOR: Dr. Günter Kolousek
#+DATE: \copy Dr. Günter Kolousek \hspace{12ex} [[http://creativecommons.org/licenses/by-nc-nd/4.0/][Creative Commons Namensnennung - Nicht kommerziell - Keine Bearbeitungen 4.0 International Lizenz]]

#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]u
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX: \newcommand{\cpp}{C++\xspace}

* PID & PPID
#+header: :exports code :results output :tangle src/pid.cpp :flags -std=c++20
#+begin_src C++
#include <iostream>  // pid.cpp
// not part of standard C; part of POSIX.1
// therefore it is not named: <cunistd>
#include <unistd.h>

using namespace std;

int main() {
    cout << "pid: " << getpid() << endl;
    cout << "ppid: " << getppid() << endl;
    cout << "uid: " << getuid() << endl;
    cout << "euid: " << geteuid() << endl;
}
#+end_src

#+RESULTS:
: pid: 3277
: ppid: 5874
: uid: 1000
: euid: 1000

* Starten eines Prozesses
#+header: :exports both :results output :tangle src/clone.cpp :flags -std=c++20
#+begin_src C++
#include <iostream>  // clone.cpp
// not part of standard C → *not* <cunistd>
#include <unistd.h>  // fork
using namespace std;
int main() {
    cout << "just before forking...";
    fork();
    cout << "after fork()!" << endl;
}
#+end_src

#+RESULTS:
: just before forking...after fork()!
: just before forking...after fork()!

* Starten eines Prozesses -- 2
\vspace{1em}
- =fork()= dupliziert Prozess!
  - inklusive Puffer, deshalb flushen:
    #+header: :exports both :results output :tangle src/clone2.cpp :flags -std=c++20
    #+begin_src C++
    #include <iostream>  // clone2.cpp
    #include <unistd.h>
    using namespace std;
    int main() {
        cout << "just before forking..."<< endl;
        fork();
        cout << "after fork()!" << endl;
    }
    #+end_src

    #+RESULTS:
    : just before forking...
    : after fork()!
    : after fork()!

* Verwaist...
\vspace{1em}
#+header: :exports both :results output :tangle src/orphan.cpp :flags -std=c++20
#+begin_src C++
#include <iostream>  // orphan.cpp
#include <unistd.h>
#include <cstdlib>
using namespace std;
int main() {
    auto pid = fork();
    if (pid == 0) {
        cout << "parent: " << getppid() << endl;
        sleep(5);
        cout << "parent: " << getppid() << endl;
        quick_exit(EXIT_SUCCESS); }
    sleep(3);
}
#+end_src

#+RESULTS:
: my parent is: 32075
: my parent is: 1

* =execl=
\vspace{1.5em}
#+header: :exports both :results output :tangle src/execl.cpp :flags -std=c++20
#+begin_src C++
#include <iostream>  // execl.cpp
#include <unistd.h>  // execl
using namespace std;

int main() {
    // path of the executable
    // name which will be used in process table
    // 0-terminated list of arguments
    execl("/usr/bin/date", "date",
          "--iso-8601", nullptr);
}
#+end_src

#+RESULTS:
: 2015-08-04

liefert -1 zurück, wenn nicht erfolgreich und die globale Variable
=errno= wird gesetzt!

